clear;
close all;
clc;

w=0.03;
z=1;
H = tf(1,[1000 50]);
g = tf([1 0.3 0.45],[1 0]);
Gs = series(H,g);
rlocus(Gs)
sgrid(z,w)
% συμφωνα με την γραφικη επιλεγω ενα σημειο Κ ωστε οι πολοι να πληρουν τις
% προυποθεσεις. Για Κ = 1.78 και οι δυο πολου ειναι >0.03 αλλα δεν ισχυει
% το ζ=1. Αν παρουμε για ζ = 1 τοτε εχουμε προβλημα με το ω καθως ο ενας
% πολος βρικσετε εντος του 0.03.
%επομενως επιλεγουμε μια απ τις δυο περιπτωσεις
k=1.78;
gc_final = tf([k*1 k*0.3 k*0.45],[1 0]);
t = 0:0.1:1000;
y = 5.*step(feedback(series(gc_final,H),1),t);
plot(t,y)
